[{"profileid":"Family-friendly frights","Name":"Costume Parade, New Rochelle","city":"9:45 a.m., Oct. 31. New Roc City, 33 Lecount Place, New Rochelle","address":"914-960-1460","bizurl":"http://newrochelledowntown.com","desc":"The New Rochelle BID Family Fun Fall Festival’s Costume Parade begins at New Street, New Roc City (in front of Regal Cinema) and ends at Library Green Park. Treats and pumpkin-painting under the green tents at the BID Farmers Market follows.","lat":"New Rochelle","lng":"","url":""},{"profileid":"Family-friendly frights","Name":"Boo at The Zoo, Bear Mountain","city":"10:30 a.m., Oct. 24 Bear Mountain State Park","address":"845-786-2701","bizurl":"http://nysparks.com/events/event-results.aspx?pk=13","desc":"Make spooky snacks for the black bears at the Bear Den and watch the bears enjoy the tasty Halloween decorations. Touch real animal skulls, see stuffed specimens in the Nature Study museums, make crafts and learn about bats, owls and vultures.","lat":"Bear Mountain","lng":"","url":""},{"profileid":"Family-friendly frights","Name":"Cross County Shopping Center's Spooktacular, Yonkers","city":"Free 5-8 p.m., Oct. 23. 8000 Mall Walk, Yonkers","address":"914-968-9570","bizurl":"http://crosscountycenter.com/Events","desc":"Kids aged 12 and under can wear costumes and visit Cross County Shopping Center's Spooktacular. They'll enjoy a magic show, a costume contest, live music from the Monster Mash and a trick-or-treating parade through the outdoor shopping center.","lat":"Yonkers","lng":"","url":""},{"profileid":"Family-friendly frights","Name":"Fall Festival, Scarsdale","city":"11 a.m.-3 p.m. Oct. 11. Greenburgh Nature Center, 99 Dromore Road, Scarsdale","address":"","bizurl":"http://www.greenburghnaturecenter.org","desc":"Scarecrow building, pumpkin carving and painting, cider making, animals, scavenger hunts, tractor rides and more. A fee applies.   Scarecrows are left at the Nature Center and used at our Scarecrows & Pumpkins Parade.","lat":"Scarsdale","lng":"","url":""},{"profileid":"Family-friendly frights","Name":"Great Jack O’Lantern Blaze, Croton-on-Hudson","city":"Begins at 7 p.m. Oct. 2 through Nov. 15. Van Cortlandt Manor, 525 S Riverside Ave, Croton-On-Hudson","address":"","bizurl":"http://hudsonvalley.org","desc":"More than 7,000 hand-carved jack o’lanterns will be on display as visitors navigate the grounds of Van Cortlandt Manor in the event’s biggest year to date. You’ll see a planetarium, animals, dinosaurs, an animated grandfather clock, jack in the boxes and much more all made out of pumpkins. $16-$25.","lat":"Croton-on-Hudson","lng":"","url":"blaze.jpg"},{"profileid":"Family-friendly frights","Name":"Halloween Art: Mask Workshop, Rye","city":"Ages 8-9: 10-11:30 a.m.; ages 10 and older: noon-1:30 p.m. Oct. 3.  Rye Arts Center, 51 Milton Road, Rye","address":"914-967-0700","bizurl":"http://yeartscenter.org","desc":"From furry animals to scary ghosts, you can create your own Halloween mask that is also weather resistant. All materials will be supplied. $20 per workshop.","lat":"Rye","lng":"","url":""},{"profileid":"Family-friendly frights","Name":"Halloween Parade and Carnival, Yorktown","city":"2 p.m. Oct. 31. 1905 Commerce St., Yorktown","address":"","bizurl":"http://yorktownny.org","desc":"The Halloween parade begins at 2 p.m. at the Yorktown Plaza Park Participants will march to the Yorktown Community & Cultural Center for outdoor Halloween activities, costume showcase, hayrides and entertainment. Free.","lat":"Yorktown","lng":"","url":""},{"profileid":"Family-friendly frights","Name":"Irving’s Legend, Sleepy Hollow","city":"Oct. 2-Nov. 1. Old Dutch Church, 430 North Broadway, Sleepy Hollow. Parking is at Philipsburg Manor, 381 North Broadway.","address":"","bizurl":"http://hudsonvalley.org","desc":"Master storyteller Johnathon Kruk will present an approximately 45-minute dramatic performance of “The Legend of Sleepy Hollow.” Recommended for ages 10 and up. $20-$25.","lat":"Sleepy Hollow","lng":"","url":"irvinglegend.jpg"},{"profileid":"Family-friendly frights","Name":"Jay Ghoul's House of Curiosities, Tarrytown","city":"Begins at 6 p.m. Oct. 16-31. 635 S Broadway, Tarrytown","address":"","bizurl":"http://lyndhurst.org/programs","desc":"Meet long-dead residents of Lyndhurst Mansion as they lead you on an evening tour of the gothic castle. Though the event is spooky, kids are welcome when accompanied by an adult. Afterward, explore the lit scarecrows fields on the grounds. $25.","lat":"Tarrytown","lng":"","url":""},{"profileid":"Family-friendly frights","Name":"The Legend Behind the “Legend,\" Irvington","city":"Oct. 3-Nov. 1. Washington Irving’s Sunnyside, 3 W Sunnyside Lane, Irvington","address":"","bizurl":"http://hudsonvalley.org","desc":"Washington Irving's estate will showcase several objects related to \"The Legend of Sleepy Hollow\" and other Irving tales. Guests will also have the chance to see a shadow puppet performance of the story and experience one of Irving's spooky tales on a walk through the woods. $8-$14.","lat":"Irvington","lng":"","url":"legendbehindlegend.jpg"},{"profileid":"Family-friendly frights","Name":"Legoland Halloween Party, Yonkers","city":"Begins at 10 a.m. Oct. 31. 39 Fitzgerald Street, Yonkers","address":"","bizurl":"http://legolanddiscoverycenter.com/westchester","desc":"Legoland Discover Center Westchester will celebrate Halloween all day beginning at 10 a.m. Oct. 31. \"Brick-or-treat\" throughout the center for pieces to build a Lego bat, receive a limited edition Halloween Lego brick and more. Kids who come in costume get $3 off admission. $17.50; $15 for kids.","lat":"Yonkers","lng":"","url":""},{"profileid":"Family-friendly frights","Name":"Nyack Halloween Parade, Nyack","city":"5:30 p.m. Oct. 24, rain date is Oct. 25. Downtown Nyack","address":"","bizurl":"","desc":"More than 20,000 spectators and marchers are expected to flood Nyack for its  parade. Marchers will meet at 4 p.m. in Memorial park before stepping off at 5:30 p.m., onto Piermont Ave., ending on Main St. After the parade, prizes will be awarded for various costume contests and there will be live music and activities. A registration form for both marchers and floats can be found at nyackchamber.org and must be submitted by Oct. 18. Free.","lat":"Nyack","lng":"","url":"nyackhalloween.jpg"},{"profileid":"Family-friendly frights","Name":"Pumpkin Carving and Fall Walk, Rye","city":"4-5:30 p.m. Oct. 30. Rye Nature Center, 873 Boston Post Road, Rye","address":"","bizurl":"http://ryenaturecenter.org","desc":"Search our local forest for seasonal changes and carve a pumpkin to create a spooky or silly face. For ages 5 and older. $20. Advanced registration required.","lat":"Rye","lng":"","url":""},{"profileid":"Family-friendly frights","Name":"Scarecrow and Pumpkin Parade, Scarsdale","city":"11 a.m.-3 p.m. Oct. 25. Greenburgh Nature Center, 99 Dromore Road, Scarsdale","address":"","bizurl":"http://greenburghnaturecenter.org","desc":"Follow friendly scarecrows on a pumpkin trail and meet storybook characters along the way. Children are encouraged to arrive in costume and there will be cider and treats. $5-$10 in advance; $8-$15 same day.","lat":"Scarsdale","lng":"","url":"scarecrowspumpkins.jpg"},{"profileid":"Family-friendly frights","Name":"Spooky Moves, Sleepy Hollow","city":"2 p.m. Oct. 11. 28 Beekman St., Sleepy Hollow","address":"","bizurl":"http://www.rivertownartistsworkshop.org","desc":"Rivertown Artists Workshop presents a performance of spooky contemporary dance, music and theater in bite sized pieces just for families. Performance runs 30 minutes, followed by Halloween-themed activities!   $10 adults, $5 children.","lat":"Sleepy Hollow","lng":"","url":""},{"profileid":"Family-friendly frights","Name":"Spooky Tales: Stories to Tickle Your Spine, Katonah","city":"3:30 p.m. Oct. 30. Caramoor, 149 Girdle Ridge Rd, Katonah","address":"","bizurl":"http://caramoor.org","desc":"Storyteller LuAnn Adams will tell spooky (but not too scary) folktales from around the world featuring ghosts, witches, goblins and pumpkins. There will be audience participation and puppets and after the event, hot cider and cookies will be served and prizes given to all. Costumes are encouraged. Recommended for ages 3-8. $12.50; $9 for kids.","lat":"Katonah","lng":"","url":""},{"profileid":"Family-friendly frights","Name":"Tarrytown Halloween Parade, Tarrytown","city":"5:30 p.m. Oct. 24 (rain date Oct. 25). Route 9, Tarrytown","address":"","bizurl":"http://tarrytownhalloweenparade.com","desc":"Stepping off from Patriots Park at 5:30 p.m., the parade will proceed south on Route 9 (Broadway) before turning onto Main St. towards the YMCA. Following the parade, Main St. will be closed for a black party. Register to march in the parade by Oct. 22 at tarrytownhalloweenparade.com. Free.","lat":"Tarrytown","lng":"","url":""},{"profileid":"Family-friendly frights","Name":"Spooktoberfest, Greenburgh","city":"12-4:30 p.m. Oct. 17. Parking will be at Ridge Road Park, where there will be shuttle buses available to the event at Hart’s Brook Park on Preserve","address":"","bizurl":"","desc":"Kids can get their face painted, check out a petting zoo, enjoy a hayride, run an inflatable obstacle course and more. Entertainment will include musicians, jugglers, clowns and a magician and a Superhero Training Academy. $6 tickets are sold onsite. Event is rain or shine, and a weather hotline is set up at 914-693-8985 ext. 133 .","lat":"Greenburgh","lng":"","url":"spooktacular.jpg"},{"profileid":"Serious scares","Name":"The Haunt at Rocky Ledge, White Plains","city":"Weekends Oct. 9-31. 1402 Old Orchard St., White Plains","address":"","bizurl":"http://hauntatrockyledge.com","desc":"Boasting the only haunted cornfield in Westchester, The Haunt at Rocky Ledge’s indoor/outdoor attraction also features two haunted houses, a nightmarish walk through the woods and more across its eight acre property. Recommended for ages ten and up. $20.","lat":"White Plains","lng":"","url":"hauntatrocky.jpg"},{"profileid":"Serious scares","Name":"The Haunt at 30 Knapp Road, Stony Point","city":"8 p.m. Saturdays in October. On Halloween, the haunt will be open at 4 p.m. 30 Knapp Road, Stony Point","address":"","bizurl":"http://thirtyknapproad.com","desc":"The owners of 30 Knapp Road turn their own home into a Halloween attraction each year, with 2015's event claiming to be the largest. And with the organizers adding to the scares each week, it'll get better and better with each return trip. The event is free, but donations are accepted with proceeds going to future haunts.","lat":"Stony Point","lng":"","url":""},{"profileid":"Serious scares","Name":"Horseman’s Hollow, Sleepy Hollow","city":"Oct.2-Nov. 1. Philipsburg Manor, 381 N Broadway, Sleepy Hollow","address":"","bizurl":"http://hudsonvalley.org","desc":"Providing a twisted take on \"The Legend of Sleepy Hollow,\" Horseman's Hollow takes the tale to its terrifying extreme. Guests first navigate a haunted trail, catching glimpses of a town driven mad by the Headless Horseman. From there, they'll enter the twisted maze of Ichabod's Schoolhouse before finding themselves in the lair of the Horseman himself. Recommended for ages 10 and up. $20 ($25 on Saturdays).","lat":"Sleepy Hollow","lng":"","url":"horsemanhollow.jpg"},{"profileid":"Serious scares","Name":"Scared by the Sound, Rye","city":"Oct. 3-31. 1 Playland Parkway, Rye","address":"","bizurl":"http://scaredbythesound.com","desc":"Returning for the 16th year, Scared by the Sound will transform Rye Playland to an anything-but-amusement park when it opens its doors to the crypt walk, the haunted wine cellar, morgue, tunnel of doom and more. $16.","lat":"Rye","lng":"","url":"scaredbythesound.jpg"},{"profileid":"Serious scares","Name":"Sleepy Hollow Haunted Hayride, Sleepy Hollow","city":"Begins at 5 p.m., hayrides at 7 Oct. 23 and 24. Sleepy Hollow Village Hall, 28 Beekman Ave","address":"","bizurl":"http://sleepyhollowny.gov","desc":"Follow the path of Ichabod Crane on Sleepy Hollow’s annual haunted hayride. As the wagon enters the darkened woods, you’ll see scary sites and might even have a run-in with the famed Headless Horseman. A free block party on Beekman Ave. will host live music, kid’s activities and vendors before and after the rides. $20 in advance; $30 at the gate.","lat":"Sleepy Hollow","lng":"","url":"sleepyhollow.jpg"},{"profileid":"Nonfiction fear","Name":"Historic Tours with a Halloween Twist, Tarrytown","city":"Oct. 16-31. 635 South Broadway, Tarrytown","address":"","bizurl":"http://lyndhurst.org","desc":"Lyndhurst's historic tours are given the Halloween treatment. Rarely seen and unusual historical items not usually displayed on the tour will be shown. Not recommended for children under six. $18.","lat":"Tarrytown","lng":"","url":""},{"profileid":"Nonfiction fear","Name":"Historical Presentation on Sleepy Hollow Cemetary, Sleepy Hollow","city":"7 p.m. Oct. 7. In the Budarz Theater, Ossining Public Library, 53 Croton Ave, Ossining","address":"","bizurl":"http://ossininglibrary.org","desc":"Hear some of the fascinating stories behind the stones of this 166-year old cemetery and learn more about its art, architecture and symbolism during this one-hour presentation. Christina Orban-LaSalle will give an informative and educational talk on the famous cemetery. Free.","lat":"Sleepy Hollow","lng":"","url":""},{"profileid":"Nonfiction fear","Name":"Oak Hill Walking Tour, Nyack","city":"2 p.m. Oct. 18. Tour meets at the entrance gate on Route 9W behind Nyack Hospital","address":"","bizurl":"http://friendsofthenyacks.org","desc":"Visit the \"permanent residents of the Nyacks\" with a guided tour of Oak Hill Cemetery. You'll be led past the graves of Edward Hopper, Helen Hayes, Charles MacArthur and more. You'll also stop by one of the final resting places of Civil War soldiers, the founders of Nyack, a police officer slain during the 1981 Brinks robbery and others. $5 donation at the start of tour.","lat":"Nyack","lng":"","url":""},{"profileid":"Nonfiction fear","Name":"Sleepy Hollow Cemetery tours, Sleepy Hollow","city":"540 North Broadway, Sleepy Hollow","address":"","bizurl":"http://sleepyhollowcemetery.org","desc":"Sleepy Hollow Cemetery offers daytime guided tours all the time, but for a truly spooky experience, we recommend the evening lantern tours. Themes include “Titans of Industry,” “Ladies of the Hollow” and, perfect for Halloween, the “Murder and Mayhem” tour. Advance registration required. $9.99 to $24.99.","lat":"Sleepy Hollow","lng":"cemeterytour.jpg","url":""},{"profileid":"Nonfiction fear","Name":"Tour of Historic Cemeteries in Rockland, Rockland","city":"Bus departs and returns to Westchester Burger Company, 78 North Route 303, West Nyack","address":"845-634-9629","bizurl":"http://www.rocklandhistory.org","desc":"The Historical Society of Rockland County will offer a guided bus tour of several historic cemeteries including Germonds, Martinus Hogencamp, Mount Rest, Coe, Nanuet and St. Paul's Highview.$64 for members; $69 non-members. Includes bus transportation, guided tour and lunch. Reservations required at 845-634-9629 or www.rocklandhistory.org","lat":"Rockland","lng":"historiccemeterytour.jpg","url":""},{"profileid":"Screams on stage and screen","Name":"“Suspense! Halloween Radio,” Garrison","city":"7 p.m. Oct. 28-31 and Nov. 4-8. Boscobel, 1601 Route 9D, Garrison","address":"","bizurl":"http:// hvshakespeare.org","desc":"Hudson Valley Shakespeare Company will partners with professional Foley artists to produce two spooky radio plays. “The Hitchhiker” focuses on a man being pursued by the seemingly-supernatural titular hitchhiker and “Sorry, Wrong Number” tells the story of a woman who accidentally eavesdrops on plans for a murder. $50-$70.","lat":"Garrison","lng":"","url":""},{"profileid":"Screams on stage and screen","Name":"\"Carrie: The Musical,\" Irvington","city":"Oct. 30-Nov. 7. 85 Main St","address":"","bizurl":"http://TNNY.com","desc":"And you thought your prom night was bad? Theatre Now New York will be at Irvington Town Hall Theater presenting “Carrie: The Musical,” based on the horror classic. $25-$35.","lat":"Irvington","lng":"","url":""},{"profileid":"Screams on stage and screen","Name":"\"Carrie: The Musical,\" Mamaroneck","city":"931C East Boston Post Road, Mamaroneck","address":"914-630-0804","bizurl":"http://wstshows.com","desc":"Westchester Sandbox Theatre is presenting \"Carrie: The Musical\" as its Main Stage Production. $24-$28. Oct. 2-10. $28; $24 for children and seniors.","lat":"Mamaroneck","lng":"","url":""},{"profileid":"Screams on stage and screen","Name":"“Alfred Hitchcock Presents,\" Nyack","city":"Oct. 16-Nov. 7. 94 Main St., Nyack","address":"845-826-2639","bizurl":"http://nyackvillagetheatre.com","desc":"See three one-act plays based on the work of the Master of Horror when Nyack Village Theatre hosts “Alfred Hitchcock Presents.” $20;  $17 for students and seniors. Save $2 by buying tickets in advance at online.","lat":"Nyack","lng":"","url":""},{"profileid":"Screams on stage and screen","Name":"“The Pit & the Pendulum,” Ossining","city":"7 p.m. Oct. 29. Ossining Public Library, 53 Croton Ave, Ossining","address":"","bizurl":"http://ossininglibrary.org","desc":"Voice-over actor Alan Sklar will be at the library to give a reading of “The Pit & the Pendulum.” Free.","lat":"Ossining","lng":"","url":""},{"profileid":"Screams on stage and screen","Name":"\"Rocky Horror Picture Show,\" Peekskill","city":"Oct. 30. 1008 Brown St., Peekskill","address":"914-739-0039","bizurl":"http://paramounthudsonvalley.com","desc":"Do the Time Warp with two screenings of “The Rocky Horror Picture Show” at Paramount Hudson Valley — one at 8 p.m. and one at midnight — on Oct. 30. The 2nd Annual Peekskill Zombie Crawl starts at 2 p.m. and will have guests getting their drink on at local clubs. A costume party starts at 10 p.m. with DJ Delta providing a soundtrack before the midnight screening. $10.","lat":"Peekskill","lng":"","url":"rockyhorror.jpg"},{"profileid":"Screams on stage and screen","Name":"Up all Night movie marathon, Pleasantville​","city":"Check in between 8:30 and 9:15 p.m., Oct. 23. Jacob Burns Film Center, 364 Manville Road, Pleasantville","address":"914-773-7663","bizurl":"http://burnsfilmcenter.org","desc":"Stay up all night with six horror movies, including “The Evil Dead,” “Friday the 13th VIII: Jason Takes Manhattan” with a live comedy commentary from the We Hate Movie podcast and a screening of “Scream” in honor of Wes Craven. There will also be food, drinks, a costume contest and more activities. $50, but you save $10 if you get them before Oct. 16.","lat":"Pleasantville","lng":"","url":""},{"profileid":"Screams on stage and screen","Name":"\"Nosferatu,\" Suffern","city":"97 Lafayette Ave., Suffern","address":"845-547-2121","bizurl":"http://lafayettetheatersuffern.com","desc":"Kick off Halloween with a screening of the 1929 silent film classic “Nosferatu” at Lafayette Theatre. You’ll even enjoy live accompaniment on the venue’s Mighty Wurlitzer Organ. An 11 a.m. organ concert will precede the 11:30 screening Oct. 31. $5.","lat":"Suffern","lng":"","url":"nosferatu.jpg"},{"profileid":"Screams on stage and screen","Name":"\"Rocky Horror Picture Show,\" Tarrytown","city":"11:30 p.m. Oct. 23. 13 Main St., Tarrytown","address":"914-631-3390","bizurl":"http://tarrytownmusichall.org","desc":"Tarrytown Music Hall will screen \"The Rocky Horror Picture Show\" with veteran actors onhand for a \"Rocky Horror\" floor show. Grab a participation kit so that you can get in on the fun. $15; $20 with kit.","lat":"Tarrytown","lng":"","url":"rockyhorror.jpg"},{"profileid":"Screams on stage and screen","Name":"Dismember the Alamo, Yonkers","city":"5 p.m., Oct. 31. Alamo Drafthouse, 2548 Central Park Ave., Yonkers","address":"914-226-3082","bizurl":"http://drafthouse.com/yonkers","desc":"Dismember the Alamo returns this year and with four horror favorites. The lineup is a secret, but, besides the films, expect throwback trailers, food and drink specials and a costume contest. $20.","lat":"Yonkers","lng":"","url":""},{"profileid":"Adults-only costume parties","Name":"Costume party, Katonah","city":"Lasdon Park, 2610 Amawalk Road (Route 35), Katonah","address":"914-864-7268","bizurl":"http://lasdonpark.org","desc":"Lasdon Park will host its annual costume party for grown-ups, 7 p.m. to 11 p.m., Oct. 30, featuring food, drink and dancing to music provided by the Gerard Carelli Collective. The party will have a prehistoric theme. There will be prizes for the best costumes. $60. Net proceeds from the events will benefit the Lasdon Conservatory project.","lat":"Katonah","lng":"","url":""},{"profileid":"Adults-only costume parties","Name":"Costume party, Mount Vernon","city":"Maggie Spillane's Ale House, 571 Gramatan Ave., Mount Vernon","address":"914-699-8900","bizurl":"http://maggiespillanes.com","desc":"The annual haunted Halloween rooftop bash is a two-night event this year, with an open bar, DJs, and a contest with cash prizes going to the best costume on both Oct. 30 and Oct. 31. Also look to the other Spillane's for just as much fun: Mickey Spillane's in Eastchester and Molly Spillane's in Mamaroneck.","lat":"Mount Vernon","lng":"","url":""},{"profileid":"Adults-only costume parties","Name":"Gangster Halloween party, Yonkers","city":"Oct. 31. Burke's Bar, 645 Bronx River Road, Yonkers","address":"914-237-5137","bizurl":"http://www.burkesbar.com","desc":"Join Vinny Pastore from \"The Soprano's\" for a gangster-themed Halloween bash. Drink specials and cash prizes for the best gangster costume. No cover charge.","lat":"Yonkers","lng":"","url":""},{"profileid":"Adults-only costume parties","Name":"Costume Party, White Plains","city":"Oct. 31. Ron Black's Beer Hall, 181 Mamaroneck Ave., White Plains","address":"914-358-5811","bizurl":"http://ronblacks.com","desc":"Costume fanatics can earn impressive prizes: $1,000 in cash and $500 gift certificates to the Ritz Carlton’s spa were handed out last year. Live DJ, no cover charge.","lat":"White Plains","lng":"","url":""},{"profileid":"Adults-only costume parties","Name":"Costume Party, Nyack","city":"Oct. 30 and 31. Nyack Pour House, 102 Main St., Nyack","address":"845-727-7687","bizurl":"http://www.nyackpourhouse.com","desc":"Costume contests on Friday and Saturday offer more than $1,000 in prizes, plus dance music and drink specials all night.","lat":"Nyack","lng":"","url":""},{"profileid":"Adults-only costume parties","Name":"Costume party, Piermont","city":"8:30 p.m. Oct. 31. Pier 701, 701 Piermont Ave., Piermont","address":"845-848-2550","bizurl":"http://www.pier701ny.com","desc":"Enjoy dinner, drink specials and stunning Hudson river views all night. There are prizes for the best costumes and a live DJ. No cover charge.","lat":"Piermont","lng":"","url":""},{"profileid":"Adults-only costume parties","Name":"Costume party, Peekskill","city":"10 p.m. Oct. 31. Peekskill Brewery, 47-53 South Water St., Peekskill","address":"914-734-2337","bizurl":"http://www.peekskillbrewery.com","desc":"Head into the tap room at 10 p.m. (or earlier) for a fun and folksy show from Mark Sinnis. Costumes are encouraged, and there is no cover charge. We suggest going early and filling your belly in the brewpub upstairs. Free.","lat":"Peekskill","lng":"","url":""}]